#2.10. Визначте асимптотичну оцінку виконання функції у найгіршому випадку
#в термінах 𝑂–«великого» для функції:
#Що є результатом виконання наведеної функції для заданого натурального
#числа 𝑛? Чи можна оптимізувати цю функцію, покращивши її асимптотичну
#оцінку?

def f(n):
    sum = 0                       # O(1)
    for i in range(1, n + 1):     # O(n)
        sum = sum + i             # O(n)
    return sum                    # O(1)

# result: O(n), сума арифметичної прогресії
# Можна оптимізувати функцію до O(1),
# використавши формулу 0.5 * n * (n+1)
